Autodesk.Navisworks.Api.Bim360.AccountInfo
Provides information about a BIM 360 Account.

Autodesk.Navisworks.Api.Bim360.AccountInfo.#ctor


Autodesk.Navisworks.Api.Bim360.AccountInfo.AccountGuid
Guid identifier of Account.

Autodesk.Navisworks.Api.Bim360.AccountInfo.AccountId
Identifier of Account.

Autodesk.Navisworks.Api.Bim360.AccountInfo.AuthToken
AuthToken related to this Account.

Autodesk.Navisworks.Api.Bim360.AccountInfo.Name
Name of this Account.

Autodesk.Navisworks.Api.Bim360.AccountInfo.UserType
User type of this Account.